###################################################################

# Created by write_sdc on Mon Jun  8 16:09:03 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_transition 0.25 [current_design]
create_clock [get_ports clk]  -period 20  -waveform {0 10}
set_clock_uncertainty -setup 0.3  [get_clocks clk]
set_clock_uncertainty -hold 0.1  [get_clocks clk]
set_max_transition 0.15 -clock_path [get_clocks clk]
set_input_delay -clock clk  -max 0.5  [get_ports clk]
set_input_delay -clock clk  -max 0.5  [get_ports {x[15]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[14]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[13]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[12]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[11]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[10]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[9]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[8]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[7]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[6]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[5]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[4]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[3]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[2]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[1]}]
set_input_delay -clock clk  -max 0.5  [get_ports {x[0]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[31]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[30]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[29]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[28]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[27]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[26]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[25]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[24]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[23]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[22]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[21]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[20]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[19]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[18]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[17]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[16]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[15]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[14]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[13]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[12]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[11]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[10]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[9]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[8]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[7]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[6]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[5]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[4]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[3]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[2]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[1]}]
set_output_delay -clock clk  -max 0.5  [get_ports {y[0]}]
set_input_transition -max 0.5  [get_ports {x[15]}]
set_input_transition -min 0.5  [get_ports {x[15]}]
set_input_transition -max 0.5  [get_ports {x[14]}]
set_input_transition -min 0.5  [get_ports {x[14]}]
set_input_transition -max 0.5  [get_ports {x[13]}]
set_input_transition -min 0.5  [get_ports {x[13]}]
set_input_transition -max 0.5  [get_ports {x[12]}]
set_input_transition -min 0.5  [get_ports {x[12]}]
set_input_transition -max 0.5  [get_ports {x[11]}]
set_input_transition -min 0.5  [get_ports {x[11]}]
set_input_transition -max 0.5  [get_ports {x[10]}]
set_input_transition -min 0.5  [get_ports {x[10]}]
set_input_transition -max 0.5  [get_ports {x[9]}]
set_input_transition -min 0.5  [get_ports {x[9]}]
set_input_transition -max 0.5  [get_ports {x[8]}]
set_input_transition -min 0.5  [get_ports {x[8]}]
set_input_transition -max 0.5  [get_ports {x[7]}]
set_input_transition -min 0.5  [get_ports {x[7]}]
set_input_transition -max 0.5  [get_ports {x[6]}]
set_input_transition -min 0.5  [get_ports {x[6]}]
set_input_transition -max 0.5  [get_ports {x[5]}]
set_input_transition -min 0.5  [get_ports {x[5]}]
set_input_transition -max 0.5  [get_ports {x[4]}]
set_input_transition -min 0.5  [get_ports {x[4]}]
set_input_transition -max 0.5  [get_ports {x[3]}]
set_input_transition -min 0.5  [get_ports {x[3]}]
set_input_transition -max 0.5  [get_ports {x[2]}]
set_input_transition -min 0.5  [get_ports {x[2]}]
set_input_transition -max 0.5  [get_ports {x[1]}]
set_input_transition -min 0.5  [get_ports {x[1]}]
set_input_transition -max 0.5  [get_ports {x[0]}]
set_input_transition -min 0.5  [get_ports {x[0]}]
set_input_transition -max 0.5  [get_ports clk]
set_input_transition -min 0.5  [get_ports clk]
